Show / Hide Table of Contents
Class HingeElement1D
Representation of hinge element 1D
Inheritance
System.Object
OpenObject
OpenElementId
HingeElement1D
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.HingeElement1D,CI.StructuralElements", "CI.StructModel.Structure.IHingeElement1D,CI.BasicTypes")]
public class HingeElement1D : OpenElementId
Properties
Improve this Doc   View Source
HingeTypeRX
Hinge type in dirrection round X
Declaration
public HingeTypeInDirrection HingeTypeRX { get; set; }
Property Value
 Type |  Description
 HingeTypeInDirrection
Improve this Doc   View Source
HingeTypeRY
Hinge type in dirrection round Y
Declaration
public HingeTypeInDirrection HingeTypeRY { get; set; }
Property Value
 Type |  Description
 HingeTypeInDirrection
Improve this Doc   View Source
HingeTypeRZ
Hinge type in dirrection round Z
Declaration
public HingeTypeInDirrection HingeTypeRZ { get; set; }
Property Value
 Type |  Description
 HingeTypeInDirrection
Improve this Doc   View Source
HingeTypeX
Hinge type in dirrection X
Declaration
public HingeTypeInDirrection HingeTypeX { get; set; }
Property Value
 Type |  Description
 HingeTypeInDirrection
Improve this Doc   View Source
HingeTypeY
Hinge type in dirrection Y
Declaration
public HingeTypeInDirrection HingeTypeY { get; set; }
Property Value
 Type |  Description
 HingeTypeInDirrection
Improve this Doc   View Source
HingeTypeZ
Hinge type in dirrection Z
Declaration
public HingeTypeInDirrection HingeTypeZ { get; set; }
Property Value
 Type |  Description
 HingeTypeInDirrection
Improve this Doc   View Source
InitialStiffnessRX
Initial stiffness rotational RX
Declaration
public double InitialStiffnessRX { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
InitialStiffnessRY
Initial stiffness rotational RY
Declaration
public double InitialStiffnessRY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
InitialStiffnessRZ
Initial stiffness rotational RZ
Declaration
public double InitialStiffnessRZ { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
InitialStiffnessX
Initial stiffness X dirrection
Declaration
public double InitialStiffnessX { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
InitialStiffnessY
Initial stiffness Y dirrection
Declaration
public double InitialStiffnessY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
InitialStiffnessZ
Initial stiffness Z dirrection
Declaration
public double InitialStiffnessZ { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source